kebasaa/datalogger_esp8266/src/main.cpp
uint32_t i2c_error_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < sizeof(i2c_error_count) / sizeof(i2c_error_count[0]); i++) total += i2c_error_count[i];
  return total;
}

uint32_t i2c_recovery_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < sizeof(i2c_recovery_count) / sizeof(i2c_recovery_count[0]); i++) total += i2c_recovery_count[i];
  return total;
}

void build_data_header() {
  CsvBuffer header;
  csv_init(header, data_header, sizeof(data_header));
  csv_append_raw(header, "boot_id,sample_counter,uptime_ms,timestamp_boot_ms,reset_reason,boot_time_source,rtc_time_valid,supervisor_restart_reason,");
#if USE_GPS
  csv_append_raw(header, "gps_date_valid,gps_time_fresh,gps_time_sane,gps_location_valid,gps_location_fresh,gps_chars_processed,gps_age_ms,gps_location_age_ms,gps_stale_count,gps_recovery_count,gps_poll_timeout_count,gps_i2c_recovery_count,gps_quarantine_active,gps_quarantine_count,gps_rejected_time_count,timestamp_utc,timestamp_calc_utc,timestamp_calc_source,lat,lon,alt,nb_sat,HDOP,");
#endif
#if USE_BATTERY
  csv_append_raw(header, "bat.mV,bat.perc,");
#endif

#if I2C_MULTI
  size_t n = sizeof(i2c_buses)/sizeof(i2c_buses[0]);
  for (size_t i = 0; i < n; ++i) {
#endif
#if USE_ADS1115
    csv_append_raw(header, "Sin.W_m2,Sout.W_m2,");
#endif
#if USE_BME280
    csv_append_raw(header, "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,");
  #if USE_CAL
    csv_append_raw(header, "bme_T.C.cal,bme_T.flag,bme_P.Pa.cal,bme_P.flag,bme_H2O.mmol_mol.cal,bme_H2O.mmol_mol.flag,bme_RH.perc.cal,bme_RH.flag,");
  #else
    csv_append_raw(header, "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,");
  #endif
#endif
#if USE_SCD30
    csv_append_raw(header, "scd_T.C,scd_RH.perc,scd_CO2.ppm,");
  #if USE_CAL
    csv_append_raw(header, "scd_CO2.ppm.cal,scd_CO2.flag,");
  #else
    csv_append_raw(header, "scd_CO2.ppm,");
  #endif
#endif
#if USE_SEN0465
    csv_append_raw(header, "sen_T.C,sen_O2.mmol_mol,sen_raw_V,");
  #if USE_CAL
    csv_append_raw(header, "sen_O2.mmol_mol.cal,sen_O2.flag,");
  #else
    csv_append_raw(header, "sen_O2.mmol_mol,");
  #endif
#endif
#if USE_MLX90614
    csv_append_raw(header, "mlx_T.C,mlx_obj_T.C,");
#endif
#if I2C_MULTI
  }
#endif
  csv_append_raw(header, "free_heap,max_heap_block,min_heap_block,i2c_slow_count,i2c_error_count,i2c_recovery_count,");
  for (size_t i = 0; i < sizeof(i2c_error_count) / sizeof(i2c_error_count[0]); i++) {
    csv_appendf(header, "i2c_bus%u_error_count,i2c_bus%u_consecutive_error_count,i2c_bus%u_recovery_count,", (unsigned)i, (unsigned)i, (unsigned)i);
  }
  csv_append_raw(header, "valid_sensor_value_count,missing_sensor_value_count,critical_sensor_loss_count,gps_i2c_hard_fault_count,supervisor_reset_count,");
  csv_append_raw(header, "write_status,");
  data_header_ready = !header.truncated;
}

void recoverI2C(size_t bus_index) {
#if I2C_MULTI
  mp.disableAllBuses();
#endif
#if defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RP2040)
  Wire.end();
#endif
  Wire.begin();
#if USE_BME280
  bme_sensors[bus_index]->init();
#endif
#if USE_SCD30
  if (scd_sensors[bus_index]->init()) {
    scd_sensors[bus_index]->enable_self_calibration(false);
    scd_sensors[bus_index]->set_interval(2);
  }
#endif
#if USE_SEN0465
  sen_sensors[bus_index]->init();
#endif
#if I2C_MULTI
  mp.disableAllBuses();
#endif
  i2c_recovery_count[bus_index]++;
  i2c_last_recovery_ms[bus_index] = millis();
  i2c_recovery_status_pending = true;
}

void record_i2c_health(size_t bus_index, uint32_t elapsed_ms, bool error_seen) {
  if (elapsed_ms > I2C_SLOW_THRESHOLD_MS) i2c_slow_count[bus_index]++;
  if (error_seen || elapsed_ms > I2C_SLOW_THRESHOLD_MS) {
    if (i2c_consecutive_error_count[bus_index] == 0) i2c_error_count[bus_index]++;
    i2c_consecutive_error_count[bus_index]++;
  } else {
    i2c_consecutive_error_count[bus_index] = 0;
    return;
  }
  uint32_t now_ms = millis();
  if (i2c_consecutive_error_count[bus_index] >= I2C_RECOVERY_CONSECUTIVE_ERRORS &&
      (i2c_last_recovery_ms[bus_index] == 0 || now_ms - i2c_last_recovery_ms[bus_index] >= I2C_RECOVERY_COOLDOWN_MS)) {
    recoverI2C(bus_index);
  }
}

bool isGPSDateValid();
bool isGPSTimeFresh();
bool isGPSLocationFresh();
void recoverGPS();

uint16_t write_status_row(const char* event, uint16_t related_write_status) {
#if USE_MICROSD
  if (!gps_boot_locked || last_valid_gps_date[0] == '\0') return MicroSD::WRITE_CARD_MISSING;
  char status_fn[32];
  const char* status_file_date = timestamp_file_date_buf[0] ? timestamp_file_date_buf : last_valid_gps_date;
  snprintf(status_fn, sizeof(status_fn), "status_%s.csv", status_file_date);
  const char* status_header =
    "event,boot_id,sample_counter,uptime_ms,reset_reason,free_heap,max_heap_block,min_heap_block,"
    "boot_time_source,rtc_time_valid,supervisor_restart_reason,"
    "gps_date_valid,gps_time_fresh,gps_time_sane,gps_location_valid,gps_location_fresh,gps_stale_count,gps_recovery_count,"
    "gps_poll_timeout_count,gps_i2c_recovery_count,gps_quarantine_active,gps_quarantine_count,gps_rejected_time_count,"
    "valid_sensor_value_count,missing_sensor_value_count,critical_sensor_loss_count,gps_i2c_hard_fault_count,supervisor_reset_count,"
    "i2c_error_count,i2c_recovery_count,related_write_status,card_missing_count,header_open_fail_count,"
    "append_open_fail_count,print_fail_count,flush_fail_count,close_fail_count,";
  CsvBuffer row;
  csv_init(row, status_row_buf, sizeof(status_row_buf));
  csv_field(row, event);
  csv_uint(row, boot_id);
  csv_uint(row, sample_counter);
  csv_uint(row, millis() - boot_ms);
  csv_field(row, reset_reason_buf);
  csv_uint(row, heap_free_now());
  csv_uint(row, heap_max_block_now());
  csv_uint(row, heap_min_block_now());
  csv_field(row, boot_time_source_buf);
  csv_int(row, rtc_time_valid ? 1 : 0);
  csv_field(row, supervisor_restart_reason_buf);
#if USE_GPS
  csv_int(row, isGPSDateValid() ? 1 : 0);
  csv_int(row, isGPSTimeFresh() ? 1 : 0);
  csv_int(row, gps_time_sane ? 1 : 0);
  csv_int(row, gps.locationValid() ? 1 : 0);
  csv_int(row, isGPSLocationFresh() ? 1 : 0);
  csv_uint(row, gps_stale_count);
  csv_uint(row, gps_recovery_count);
  csv_uint(row, gps_poll_timeout_count);
  csv_uint(row, gps_i2c_recovery_count);
  csv_int(row, gps_quarantine_active ? 1 : 0);
  csv_uint(row, gps_quarantine_count);
  csv_uint(row, gps_rejected_time_count);
#else
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_int(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
#endif
  csv_uint(row, valid_sensor_value_count);
  csv_uint(row, missing_sensor_value_count);
  csv_uint(row, critical_sensor_loss_count);
  csv_uint(row, gps_i2c_hard_fault_count);
  csv_uint(row, supervisor_reset_count);
  csv_uint(row, i2c_error_total());
  csv_uint(row, i2c_recovery_total());
  csv_uint(row, related_write_status);
  csv_uint(row, sd.cardMissingCount());
  csv_uint(row, sd.headerOpenFailCount());
  csv_uint(row, sd.appendOpenFailCount());
  csv_uint(row, sd.printFailCount());
  csv_uint(row, sd.flushFailCount());
  csv_uint(row, sd.closeFailCount());
  return sd.write_data(status_fn, status_header, status_row_buf, 86400);
#else
  return 0;
#endif
}

bool isGPSDateValid() {
    #if USE_GPS
        if (!gps.dateValid()) return false;
        int year = gps.year();
        return (year >= GPS_YEAR_MIN) && (year <= GPS_YEAR_MAX);
    #else
        return false; // Or true, depending on if you want to proceed without GPS
    #endif
}

bool isGPSTimeFresh() {
    #if USE_GPS
        return isGPSDateValid() && gps.timeValid() && gps.gpsAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

bool isGPSTimeSane(uint32_t now_ms) {
    #if USE_GPS
        if (!isGPSTimeFresh()) return false;
        return is_gps_epoch_sane(gps_epoch_now(), now_ms);
    #else
        (void)now_ms;
        return false;
    #endif
}

bool isGPSLocationFresh() {
    #if USE_GPS
        return gps.locationValid() && gps.locationAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

void recoverGPS() {
    #if USE_GPS
    #if I2C_MULTI
        mp.disableAllBuses();
    #endif
    #if defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RP2040)
        Wire.end();
    #endif
        Wire.begin();
    #if I2C_MULTI
        mp.init();
        mp.disableAllBuses();
    #endif
        gps.init();
    #if I2C_MULTI
        mp.disableAllBuses();
    #endif
        gps_recovery_count++;
        gps_i2c_recovery_count++;
        last_gps_recovery_ms = millis();
        gps_i2c_recovery_status_pending = true;
    #endif
}

void count_sensor_value(float value, uint32_t& valid_count, uint32_t& missing_count) {
  if (isnan(value)) missing_count++;
  else valid_count++;
}

bool all_i2c_buses_degraded() {
  for (size_t i = 0; i < sizeof(i2c_consecutive_error_count) / sizeof(i2c_consecutive_error_count[0]); i++) {
    if (i2c_consecutive_error_count[i] == 0) return false;
  }
  return true;
}

void start_gps_quarantine(uint32_t now_ms) {
  gps_quarantine_active = true;
  gps_quarantine_until_ms = now_ms + GPS_QUARANTINE_MS;
  gps_quarantine_count++;
  gps_i2c_quarantine_status_pending = true;
#if I2C_MULTI
  mp.disableAllBuses();
#endif
}

