kebasaa/datalogger_esp8266/src/main.cpp
void update_gps_quarantine(uint32_t now_ms) {
  if (gps_quarantine_active && (int32_t)(now_ms - gps_quarantine_until_ms) >= 0) {
    gps_quarantine_active = false;
  }
}

bool activate_rtc_boot_time(uint32_t now_ms) {
  if (!rtc_time_valid || gps_boot_locked) return false;
  last_fresh_gps_epoch = rtc_boot_epoch;
  last_fresh_gps_millis = boot_ms;
  last_fresh_gps_epoch_valid = true;
  gps_boot_locked = true;
  boot_time_from_rtc = true;
  strncpy(boot_time_source_buf, "rtc", sizeof(boot_time_source_buf) - 1);
  boot_time_source_buf[sizeof(boot_time_source_buf) - 1] = '\0';
  format_utc_date(rtc_boot_epoch + ((now_ms - boot_ms) / 1000UL), last_valid_gps_date, sizeof(last_valid_gps_date));
  boot_time_from_rtc_status_pending = true;
  return true;
}

void update_sensor_supervisor(uint32_t now_ms) {
  bool all_sensor_loss = all_i2c_buses_degraded() && valid_sensor_value_count == 0;
  bool gps_i2c_hard_fault = gps_quarantine_active && all_sensor_loss;
  if (gps_i2c_hard_fault) {
    if (gps_i2c_hard_fault_count == 0) sensor_data_lost_status_pending = true;
    gps_i2c_hard_fault_count++;
  } else {
    gps_i2c_hard_fault_count = 0;
  }

  if (gps_i2c_hard_fault_count >= GPS_I2C_HARD_FAULT_SAMPLES && gps_boot_locked) {
    supervisor_reset_count++;
    last_supervisor_reset_ms = now_ms;
    strncpy(supervisor_restart_reason_buf, "gps_i2c_hard_fault", sizeof(supervisor_restart_reason_buf) - 1);
    supervisor_restart_reason_buf[sizeof(supervisor_restart_reason_buf) - 1] = '\0';
    supervisor_restart_pending = true;
    supervisor_restart_status_pending = true;
    return;
  }

  bool critical_loss = all_sensor_loss;
  if (critical_loss) {
    if (critical_sensor_loss_count == 0) sensor_data_lost_status_pending = true;
    critical_sensor_loss_count++;
  } else {
    critical_sensor_loss_count = 0;
    return;
  }

  if (critical_sensor_loss_count < CRITICAL_SENSOR_LOSS_SAMPLES) return;
  if (!gps_boot_locked) return;
  if ((now_ms - boot_ms) < SUPERVISOR_MIN_UPTIME_MS) return;
  if (last_supervisor_reset_ms != 0 && (now_ms - last_supervisor_reset_ms) < SUPERVISOR_RESTART_COOLDOWN_MS) return;

  supervisor_reset_count++;
  last_supervisor_reset_ms = now_ms;
  strncpy(supervisor_restart_reason_buf, "sensor_loss", sizeof(supervisor_restart_reason_buf) - 1);
  supervisor_restart_reason_buf[sizeof(supervisor_restart_reason_buf) - 1] = '\0';
  supervisor_restart_pending = true;
  supervisor_restart_status_pending = true;
}

void onWiFiConnect() {
	Serial.printf("Wifi connected");
	Serial.printf("IP4 Address: %s\n",WiFi.localIP().toString().c_str());
	WiFiValid = true;
#if USE_HTTPREQ
	h4.queueFunction(HTTPClient);
	httpReqTimer = h4.every(60000, HTTPClient);
#endif
}
void onWiFiDisconnect() {
	Serial.printf("WiFi Disconnected\n");
#if USE_HTTPREQ
	h4.cancel(httpReqTimer);
#endif
}
#if USE_MQTT
void onMQTTConnect() {
	mqttSender = h4.every(2000, []()
					  {
						  publishDevice("heap", _HAL_freeHeap());
						  publishDevice("uptime",h4p.gvGetstring(upTimeTag()));
						  publishDevice("maxbloc",_HAL_maxHeapBlock());
					  });
	
	bigSender = h4.every(3000,[]{
		Serial.printf("SENDING BIG\n");
		h4mqtt.publish("big", &big[0], BIG_SIZE, 1);
	});
}
void onMQTTDisconnect() {
	Serial.printf("onMQTTDisconnect()\n");
	h4.cancel(mqttSender);
	h4.cancel(bigSender);
}
#endif

void absolute_calibration(const std::vector<String> gas_list, String abs_cal_type, int sensor, float ref_value);
void differential_calibration(const std::vector<String> gas_list, String dif_cal_type);

// Show calibration coefficients through the Serial Port. The syntax is:
// show_cal
uint32_t cal_show_cmd(std::vector<std::string> vs) {
  Serial.println("Calibration coefficients:");
  cal.show_all_calibrations(gases, numSensors);
  return H4_CMD_OK;
}

// Manually set calibration coefficients through the Serial Port. The syntax is:
// set/zero/co2/1/12.07/13.08
// set/span/co2/2/376.87/402.87
// Where the first number is the reference, and the second the measured value by the sensor for that reference
uint32_t cal_set_cmd(std::vector<std::string> vs) {
  Serial.println("Manually entering sensor calibration coefficients");
  Serial.printf("Params received: %d\n", vs.size());
  if (vs.size() < 5) {
    Serial.println("Min. 5 parameters: type (zero/span), gas, sensor number, ref. value and measured value");
    return H4_CMD_TOO_FEW_PARAMS;
  } else if(vs.size() > 5){
    Serial.println("Max. 5 parameters: type (zero/span), gas, sensor number, ref. value and measured value");
    return H4_CMD_TOO_MANY_PARAMS;
  }
  // Collect the values
  String abs_cal_type = vs[0].c_str();
  String cal_gas = vs[1].c_str();
  int sensor_nb = std::stoi(vs[2].c_str());
  float ref_value = std::stof(vs[3]);
  float sen_value = std::stof(vs[4]);
  // Forceds acceptance of serial port values no matter the timing
  int ts = 0;
  if(abs_cal_type == "span"){ ts = 20; }
  // Set calibration values
  cal.set_calibration_coeff(abs_cal_type, cal_gas, sensor_nb, ref_value, sen_value, ts);
  return H4_CMD_OK;
}

// Calibration through the Serial Port. The syntax is:
// cal/span/h2o/0/1.31
// cal/zero/co2/1
// cal/zero/co2/1/0.54
// cal/span/h2o/2/409.87
// cal/diff/co2/low
// cal/diff/co2/high
uint32_t cal_cmd(std::vector<std::string> vs) {
    Serial.println("Sensor calibration initiated");
    Serial.printf("Params received: %d\n", vs.size());
    if (vs.size() < 2) {
        Serial.println("Calibration command requires at least 2 parameters: type and gas");
        return H4_CMD_TOO_FEW_PARAMS;
    }
    std::string cal_type = vs[0];
    std::string cal_gas = vs[1];
    // Validate calibration type
    if (!utils.in_list(cal.calTypes, String(cal_type.c_str()))) {
        Serial.printf("Invalid calibration type: %s (must be %s)\n", cal_type.c_str(), utils.make_text_list(cal.calTypes));
        return H4_CMD_PAYLOAD_FORMAT;
    }
    // Validate gas
    if (!utils.in_list(gases, String(cal_gas.c_str()))) {
        Serial.printf("Invalid calibration gas: %s (must be %s)\n", cal_gas.c_str(), utils.make_text_list(gases));
        return H4_CMD_PAYLOAD_FORMAT;
    }
    //Serial.printf("Type: %s, Gas: %s\n", cal_type.c_str(), cal_gas.c_str());
    // After validation, update the global variables
    int cal_sensor = 0;
    float cal_ref_value = 0.0;
    if (cal_type == "zero") {
        // Requires sensor (3 params), cal_fef_value optional (default 0.0)
        if (vs.size() == 2) {
            Serial.println("Zero calibration requires a sensor number");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 3) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = 0.0; // Default
            Serial.printf("Zero cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            absolute_calibration({cal_gas.c_str()}, "zero", cal_sensor, cal_ref_value);
        } else if (vs.size() == 4) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = std::stoi(vs[3]);
            Serial.printf("Zero cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            absolute_calibration({cal_gas.c_str()}, "zero", cal_sensor, cal_ref_value);
        } else {
            Serial.println("Too many params for zero calibration");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    } else if (cal_type == "span") {
        // Requires sensor and cal_ref_value (4 params)
        if (vs.size() < 4) {
            Serial.println("Span calibration requires sensor and reference value");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 4) {
            cal_sensor = std::stoi(vs[2].c_str());
            cal_ref_value = std::stof(vs[3]);
            Serial.printf("Span cal: Gas: %s, Sensor=%d, Reference=%.2f\n", cal_gas.c_str(), cal_sensor, cal_ref_value);
            // Perform calibration
            currentGas = cal_gas.c_str(); // There is a clause that checks if currentGas is all in absolute_calibration(). This avoids that
            absolute_calibration({cal_gas.c_str()}, "span", cal_sensor, cal_ref_value);
        } else {
            Serial.println("Too many params for span calibration");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    } else if (cal_type == "diff") {
        // Requires type, gas and low/high (3 params), no sensor/cal_ref_value
        if(vs.size() > 3) {
            Serial.println("Diff calibration requires at least 2 parameters: gas and type (low/high)");
            return H4_CMD_TOO_FEW_PARAMS;
        } else if (vs.size() == 3) {
            // "sen" is for the high calibration, "ref" for low
            String low_high = "";
            if(vs[2] == "low"){
              low_high = "ref";
            } else if (vs[2] == "high"){
              low_high = "sen";
            } else {
              // Bad command, don't calibrate
              return H4_CMD_PAYLOAD_FORMAT;
            }
            Serial.printf("Diff cal: Gas: %s, Type=%s\n", cal_gas.c_str(), low_high);
            differential_calibration({cal_gas.c_str()}, low_high);
        } else if(vs.size() > 3) {
            Serial.println("Diff calibration does not accept sensor/reference value");
            return H4_CMD_TOO_MANY_PARAMS;
        }
    }
    return H4_CMD_OK;
}

// Measure for 5s and average, when button is pressed
float measure_gas(String gas, int sensor){
  float gas_measured = float(NAN);
  if((gas == "all") || (gas == "") || (sensor == -9999)){
    return(float(NAN));
  }
  // Note that the sensor list is 0-indexed, i.e. the number needs to be -1
  //sensor -= 1;

