kebasaa/datalogger_esp8266/src/main.cpp
  // Decide how many sensors we are reading:
  // - When multiple gases are passed, 'sensor' parameter holds # sensors to probe
  // - otherwise treat sensor as a single sensor id (so num_sensors = 1)
  const size_t num_gases = gas_list.size();
  int num_sensors = (num_gases > 1) ? sensor+1 : 1;
  if(num_sensors <= 0) num_sensors = 1; // Safeguard

  // shared accumulators (captured into lambdas by value), multiplying gases by number of sensors
  auto cumulative_data = std::make_shared<std::vector<float>>(num_gases * num_sensors, 0.0f);
  const int n_measurements = 10;
  
  h4.nTimesRandom(
        // Measure "n_measurements" times (every ~1.0-1.1s) & average
        n_measurements, 1000, 1100,
        // Run at every iteration: measure every gas and accumulate
        [gas_list, cumulative_data, num_sensors, sensor,abs_cal_type]() {
            for (size_t gas = 0; gas < gas_list.size(); gas++) { // Cycle through all gases
              if (num_sensors > 1) { // sensor is the number of sensors to be measured
                for (int s = 0; s < num_sensors; s++) { // measure all sensors for this gas
                  size_t idx = gas * num_sensors + s; // index into flattened vector
                  (*cumulative_data)[idx] += measure_gas(gas_list[gas], s);
                }
              } else { // If only 1 gas was given, num_sensors is 1, the for loop is executed once
                // "sensor" is the sensor ID and is the one measured here
                size_t idx = gas * num_sensors + 0; // This always creates index 0
                (*cumulative_data)[idx] += measure_gas(gas_list[gas], sensor);
              }
            }
            if((abs_cal_type == "zero") && (viewersConnected == true)){
              h4wifi.uiSetValue("Zero value","In progress");
              h4wifi.uiSetValue("Zero reference","In progress");
            } else if (viewersConnected == true) {
              h4wifi.uiSetValue("Span value","In progress");
              h4wifi.uiSetValue("Span reference","In progress");
            }
        },
        // Run when timer finishes: compute averages & store/set differential for each gas
        [gas_list, cumulative_data, sensor, num_sensors, n_measurements, abs_cal_type, ref_value]() {
            const unsigned long ts = gps.seconds_since_midnight(); // single timestamp
            for (size_t gas = 0; gas < gas_list.size(); gas++) {
              for (int s = 0; s < num_sensors; s++) {
                float ref_val = 0;
                if(gas_list[gas] == "h2o"){
                  ref_val = env.dewpoint_to_mole_frac(ref_value, // Dewpoint in °C
                                           bme_sensors[s]->airP()); // Convert dewpoint to H2O mole fraction [mmol/mol]
                } else {
                  ref_val = ref_value;
                }
                size_t idx = gas * num_sensors + s; // index into flattened vector
                float sensor_measured = (*cumulative_data)[idx] / static_cast<float>(n_measurements);
                // set differential for each gas
                cal.set_calibration_coeff(abs_cal_type, gas_list[gas], s, ref_val, sensor_measured, ts);
                  
                Serial.print("Gas: "); Serial.println(gas_list[gas]);
                Serial.print("  Sensor: "); Serial.println(s);
                Serial.print("    Value: "); Serial.println(sensor_measured);
                Serial.print("    Reference: "); Serial.print(ref_val);
                if(gas_list[gas] == "h2o"){Serial.println(" [mmol/mol]");}else{Serial.println("");}
                if((abs_cal_type == "zero") && (viewersConnected == true)){
                  h4wifi.uiSetValue("Zero value", CSTR(String(sensor_measured, 2)));
                  h4wifi.uiSetValue("Zero reference", CSTR(String(ref_val, 2)));
                } else if (viewersConnected == true) {
                  h4wifi.uiSetValue("Span value", CSTR(String(sensor_measured, 2)));
                  h4wifi.uiSetValue("Span reference", CSTR(String(ref_val, 2)));
                }
            }
            // reset accumulators (may be optional since shared_ptr is freed after lambda ends)
            std::fill(cumulative_data->begin(), cumulative_data->end(), 0.0f);

            if(abs_cal_type == "span"){
              save_calibration_coefficients();
            }
            calibration_running = false;
          }
        },
        0, false
    );
}

void onsetzeroButton(){
  h4wifi.uiMessage("Zero Calibration");
  Serial.println("Zero Calibration");

  if(currentSensor == -9999){ return; }
  
  if(currentGas == "all"){
    // If all gases are zero'd, then set to them to exactly 0.0
    absolute_calibration(gases, "zero", numSensors, 0.0);
  } else {
    String input_field = "Zero gas"; // Creates "Zero gas" or "Span gas" (note the upper-case)
    float ref_value = std::stof(std::string(h4p.gvGetstring(input_field.c_str()).c_str()));
    absolute_calibration({currentGas}, "zero", currentSensor, ref_value);
  }
}

void onsetspanButton(){
  h4wifi.uiMessage("Span Calibration");
  Serial.println("Span Calibration");

  if(currentSensor == -9999){ return; }

  if(currentGas == "all"){
    h4wifi.uiMessage("ERROR: Please calibrate span individually");
    Serial.println("ERROR: Please calibrate span individually");
    // Note: This will return, doing nothing (because span can't be set for different gases at once)
    absolute_calibration(gases, "span", numSensors, float(NAN));
  } else {
    String input_field = "Zero gas"; // Creates "Zero gas" or "Span gas" (note the upper-case)
    float ref_value = std::stof(std::string(h4p.gvGetstring(input_field.c_str()).c_str()));
    absolute_calibration({currentGas}, "span", currentSensor, ref_value);
  }

}

// Differential calibration
void differential_calibration(const std::vector<String> gas_list, String dif_cal_type){
  //h4wifi.uiMessage("Differential calibration running...");
  //Serial.println("Differential calibration running...");
  if (calibration_running) {
    Serial.println("Calibration already running - ignoring request");
    return;
  }
  calibration_running = true;

