kebasaa/datalogger_esp8266/src/main.cpp
/*
void onRTC(){
  Serial.println("Clock valid!");
  ClockValid = true;
  Serial.printf("\nReceived NTP time: %s (UTC)\n\n", CSTR(h4tk.strfDateTime( "%a %Y-%m-%d %H:%M:%S", h4tk.clockEPOCHLocal()) ));
}
*/

/*
void h4pGlobalEventHandler(const std::string& svc,H4PE_TYPE t,const std::string& msg)
{
	switch (t)
	{
		H4P_DEFAULT_SYSTEM_HANDLER;
	case H4PE_SERVICE:
		H4P_SERVICE_ADAPTER(WiFi);
#if USE_MQTT
		H4P_SERVICE_ADAPTER(MQTT);
#endif
		break;
	case H4PE_VIEWERS:
		H4P_SERVICE_ADAPTER(Viewers);
		break;
	default:
		break;
	}
}
*/

void processDataBuffered(void){
  CsvBuffer row;
  csv_init(row, data_row_buf, sizeof(data_row_buf));
  Cal::CalibrationResult cal_result;
  uint32_t now_ms = millis();
  uint32_t gps_chars_this_sample = 0;
  bool gps_date_valid = false;
  bool gps_time_fresh = false;
  bool gps_location_valid = false;
  bool gps_location_fresh = false;

#if USE_GPS
  update_gps_quarantine(now_ms);
  if (!gps_quarantine_active) {
    gps_chars_this_sample = gps.update_values(GPS_POLL_MAX_MS, GPS_POLL_MAX_CHARS);
    if (gps.pollTimedOut()) gps_poll_timeout_count++;
#if I2C_MULTI
    mp.disableAllBuses();
#endif
  }
  gps_date_valid = isGPSDateValid();
  gps_time_fresh = isGPSTimeFresh();
  gps_time_sane = isGPSTimeSane(now_ms);
  gps_location_valid = gps.locationValid();
  gps_location_fresh = isGPSLocationFresh();
  if (gps_time_fresh && !gps_time_sane) {
    gps_rejected_time_count++;
    gps_time_rejected_status_pending = true;
  }
  if (gps_time_sane) {
    String date = gps.get_date();
    strncpy(last_valid_gps_date, date.c_str(), sizeof(last_valid_gps_date) - 1);
    last_valid_gps_date[sizeof(last_valid_gps_date) - 1] = '\0';
    gps_boot_locked = true;
  }
  if (!gps_boot_locked) {
    if ((now_ms - boot_ms) >= BOOT_GPS_GRACE_MS && activate_rtc_boot_time(now_ms)) {
      gps_time_sane = false;
    } else {
      Serial.println(F("Waiting for first fresh/sane GPS date/time before logging"));
      return;
    }
  }
  if (!gps_quarantine_active && !gps_time_sane && gps_chars_this_sample == 0) {
    gps_stale_count++;
    if (!gps_stale_active && gps_stale_count >= GPS_STALE_CONSECUTIVE_SAMPLES) {
      gps_stale_active = true;
      gps_stale_status_pending = true;
      gps_i2c_stale_status_pending = true;
    }
    if (gps_stale_count >= GPS_STALE_CONSECUTIVE_SAMPLES &&
        (last_gps_recovery_ms == 0 || now_ms - last_gps_recovery_ms >= GPS_RECOVERY_COOLDOWN_MS)) {
      recoverGPS();
      gps_stale_recovery_count++;
      if (gps_stale_recovery_count >= GPS_QUARANTINE_AFTER_RECOVERIES) {
        start_gps_quarantine(now_ms);
      }
    }
  } else if (gps_time_sane) {
    if (gps_stale_active) gps_recovered_status_pending = true;
    if (gps_stale_active || gps_quarantine_active || gps_stale_count > 0) gps_i2c_recovered_status_pending = true;
    gps_quarantine_active = false;
    gps_quarantine_until_ms = 0;
    gps_stale_active = false;
    gps_stale_count = 0;
    gps_stale_recovery_count = 0;
  }
#else
  gps_boot_locked = true;
#endif

  if (!data_header_ready) build_data_header();
  sample_counter++;

  uint16_t row_status = last_data_write_status;
  now_ms = millis();
  uint32_t uptime_ms = now_ms - boot_ms;
  const char* timestamp_calc_source = "";
  uint32_t timestamp_calc_epoch = calculated_timestamp_epoch(gps_time_fresh, gps_time_sane, now_ms, &timestamp_calc_source);
  bool timestamp_calc_valid = timestamp_calc_epoch > 0;
  if (timestamp_calc_valid) {
    format_utc_timestamp(timestamp_calc_epoch, timestamp_calc_buf, sizeof(timestamp_calc_buf));
    format_utc_date(timestamp_calc_epoch, timestamp_file_date_buf, sizeof(timestamp_file_date_buf));
  } else {
    timestamp_calc_buf[0] = '\0';
    timestamp_file_date_buf[0] = '\0';
  }

  csv_uint(row, boot_id);
  csv_uint(row, sample_counter);
  csv_uint(row, uptime_ms);
  csv_uint(row, now_ms);
  csv_field(row, reset_reason_buf);
  csv_field(row, boot_time_source_buf);
  csv_int(row, rtc_time_valid ? 1 : 0);
  csv_field(row, supervisor_restart_reason_buf);

#if USE_GPS
  csv_int(row, gps_date_valid ? 1 : 0);
  csv_int(row, gps_time_fresh ? 1 : 0);
  csv_int(row, gps_time_sane ? 1 : 0);
  csv_int(row, gps_location_valid ? 1 : 0);
  csv_int(row, gps_location_fresh ? 1 : 0);
  csv_uint(row, gps_chars_this_sample);
  csv_uint(row, gps.gpsAgeMs());
  csv_uint(row, gps.locationAgeMs());
  csv_uint(row, gps_stale_count);
  csv_uint(row, gps_recovery_count);
  csv_uint(row, gps_poll_timeout_count);
  csv_uint(row, gps_i2c_recovery_count);
  csv_int(row, gps_quarantine_active ? 1 : 0);
  csv_uint(row, gps_quarantine_count);
  csv_uint(row, gps_rejected_time_count);
  if (gps_time_sane) {
    csv_field(row, timestamp_calc_buf);
  } else {
    csv_field(row, "");
  }
  csv_field(row, timestamp_calc_buf);
  csv_field(row, timestamp_calc_source);
  if (gps_location_fresh) {
    csv_float(row, gps.get_lat(), 8);
    csv_float(row, gps.get_lon(), 8);
  } else {
    csv_field(row, "");
    csv_field(row, "");
  }
  if (gps_location_fresh && gps.altitudeValid()) csv_float(row, gps.get_alt(), 2);
  else csv_field(row, "");
  csv_uint(row, gps.satellites());
  csv_float(row, gps.hdop(), 2);
#endif

#if USE_BATTERY
  csv_int(row, bat.battery_mV());
  csv_int(row, bat.battery_pc());
#endif

#if I2C_MULTI
  size_t n = sizeof(i2c_buses)/sizeof(i2c_buses[0]);
#else
  size_t n = 1;
#endif
  valid_sensor_value_count = 0;
  missing_sensor_value_count = 0;
  for (size_t i = 0; i < n; ++i) {
    uint32_t bus_start_ms = millis();
    bool bus_error = false;

#if USE_ADS1115
    float ads_in = ads_sensors[i]->read_val(1, 16, 25.83);
    float ads_out = ads_sensors[i]->read_val(2, 16, 30.98);
    bus_error |= isnan(ads_in) || isnan(ads_out);
    count_sensor_value(ads_in, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(ads_out, valid_sensor_value_count, missing_sensor_value_count);
    csv_float(row, ads_in, 2);
    csv_float(row, ads_out, 2);
#endif

#if USE_BME280
    float bme_temp = bme_sensors[i]->airT();
    float bme_rh   = bme_sensors[i]->airRH();
    float bme_p    = bme_sensors[i]->airP();
    float bme_h2o  = env.air_water_mole_frac(bme_temp, bme_rh, bme_p);
    bus_error |= isnan(bme_temp) || isnan(bme_rh) || isnan(bme_p) || isnan(bme_h2o);
    count_sensor_value(bme_temp, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(bme_rh, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(bme_p, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(bme_h2o, valid_sensor_value_count, missing_sensor_value_count);
    csv_float(row, bme_temp, 2);
    csv_float(row, bme_rh, 2);
    csv_float(row, bme_p, 2);
    csv_float(row, bme_h2o, 2);
  #if USE_CAL
    float rh_flag = 0;
    cal_result = cal.calibrate_linear("temperature", i, bme_temp);
    float cal_temp = cal_result.calibratedValue;
    csv_float(row, cal_temp, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    cal_result = cal.calibrate_linear("pressure", i, bme_p);
    float cal_p = cal_result.calibratedValue;
    csv_float(row, cal_p, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    cal_result = cal.calibrate_linear("h2o", i, bme_h2o);
    float cal_h2o = cal_result.calibratedValue;
    csv_float(row, cal_h2o, 2);
    csv_int(row, cal_result.flag);
    rh_flag += cal_result.flag;
    float cal_rh = env.air_relative_humidity(cal_temp, cal_p, cal_h2o);
    csv_float(row, cal_rh, 2);
    csv_float(row, rh_flag, 2);
  #else
    csv_float(row, bme_temp, 2);
    csv_float(row, bme_rh, 2);
    csv_float(row, bme_p, 2);
    csv_float(row, bme_h2o, 2);
  #endif
#endif

#if USE_SCD30
  #if USE_BME280
    if (sample_counter % 3 == 0) scd_sensors[i]->set_air_pressure(bme_p);
  #endif
    scd_sensors[i]->getData();
    float scd_T   = scd_sensors[i]->airT();
    float scd_RH  = scd_sensors[i]->airRH();
    float scd_CO2 = scd_sensors[i]->airCO2();
    bus_error |= isnan(scd_T) || isnan(scd_RH) || isnan(scd_CO2);
    count_sensor_value(scd_T, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(scd_RH, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(scd_CO2, valid_sensor_value_count, missing_sensor_value_count);
    csv_float(row, scd_T, 2);
    csv_float(row, scd_RH, 2);
    csv_float(row, scd_CO2, 2);
  #if USE_CAL
    cal_result = cal.calibrate_linear("co2", i, scd_CO2);
    csv_float(row, cal_result.calibratedValue, 2);
    csv_int(row, cal_result.flag);
  #else
    csv_float(row, scd_CO2, 2);
  #endif
#endif

#if USE_SEN0465
    float sen_T = sen_sensors[i]->airT();
    float sen_O2 = sen_sensors[i]->airO2();
    float sen_raw_v = sen_sensors[i]->rawV();
    bus_error |= isnan(sen_T) || isnan(sen_O2) || isnan(sen_raw_v);
    count_sensor_value(sen_T, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(sen_O2, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(sen_raw_v, valid_sensor_value_count, missing_sensor_value_count);
    csv_float(row, sen_T, 2);
    csv_float(row, sen_O2, 4);
    csv_float(row, sen_raw_v, 6);
  #if USE_CAL
    cal_result = cal.calibrate_linear("o2", i, sen_O2);
    csv_float(row, cal_result.calibratedValue, 4);
    csv_int(row, cal_result.flag);
  #else
    csv_float(row, sen_O2, 4);
  #endif
#endif

#if USE_MLX90614
    float mlx_t = mlx_sensors[i]->airT();
    float mlx_obj_t = mlx_sensors[i]->objT();
    bus_error |= isnan(mlx_t) || isnan(mlx_obj_t);
    count_sensor_value(mlx_t, valid_sensor_value_count, missing_sensor_value_count);
    count_sensor_value(mlx_obj_t, valid_sensor_value_count, missing_sensor_value_count);
    csv_float(row, mlx_t, 2);
    csv_float(row, mlx_obj_t, 2);
#endif

