kebasaa/datalogger_esp8266/src/main.cpp
    record_i2c_health(i, millis() - bus_start_ms, bus_error);
  }

  update_sensor_supervisor(now_ms);

  csv_uint(row, heap_free_now());
  csv_uint(row, heap_max_block_now());
  csv_uint(row, heap_min_block_now());
  csv_uint(row, i2c_slow_total());
  csv_uint(row, i2c_error_total());
  csv_uint(row, i2c_recovery_total());
  for (size_t i = 0; i < sizeof(i2c_error_count) / sizeof(i2c_error_count[0]); i++) {
    csv_uint(row, i2c_error_count[i]);
    csv_uint(row, i2c_consecutive_error_count[i]);
    csv_uint(row, i2c_recovery_count[i]);
  }
  csv_uint(row, valid_sensor_value_count);
  csv_uint(row, missing_sensor_value_count);
  csv_uint(row, critical_sensor_loss_count);
  csv_uint(row, gps_i2c_hard_fault_count);
  csv_uint(row, supervisor_reset_count);
  if (row.truncated) row_status |= ROW_STATUS_TRUNCATED;
  csv_uint(row, row_status);
  if (row.truncated) row_status |= ROW_STATUS_TRUNCATED;

#if USE_GPS
  char data_fn[32];
  const char* data_file_date = timestamp_file_date_buf[0] ? timestamp_file_date_buf : last_valid_gps_date;
  snprintf(data_fn, sizeof(data_fn), "data_%s.csv", data_file_date);
#else
  const char* data_fn = "data.csv";
#endif

#if USE_MICROSD
  uint16_t write_status = sd.write_data(data_fn,
                                        data_header,
                                        data_row_buf,
                                        MEASUREMENT_INTERVAL);
  last_data_write_status = write_status;
  if (write_status != MicroSD::WRITE_OK) sd_status_pending = true;
  if (write_status == MicroSD::WRITE_OK && (!boot_status_written || sd_status_pending)) {
    uint16_t status_write_status = write_status_row(boot_status_written ? "sd_recovered" : "boot", write_status);
    if (status_write_status == MicroSD::WRITE_OK) {
      boot_status_written = true;
      sd_status_pending = false;
    } else {
      sd_status_pending = true;
    }
  }
  if (write_status == MicroSD::WRITE_OK && gps_stale_status_pending) {
    if (write_status_row("gps_stale", write_status) == MicroSD::WRITE_OK) gps_stale_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_i2c_stale_status_pending) {
    if (write_status_row("gps_i2c_stale", write_status) == MicroSD::WRITE_OK) gps_i2c_stale_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_i2c_recovery_status_pending) {
    if (write_status_row("gps_i2c_recovery", write_status) == MicroSD::WRITE_OK) gps_i2c_recovery_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_i2c_quarantine_status_pending) {
    if (write_status_row("gps_i2c_quarantine", write_status) == MicroSD::WRITE_OK) gps_i2c_quarantine_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_time_rejected_status_pending) {
    if (write_status_row("gps_time_rejected", write_status) == MicroSD::WRITE_OK) gps_time_rejected_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && boot_time_from_rtc_status_pending) {
    if (write_status_row("boot_time_from_rtc", write_status) == MicroSD::WRITE_OK) boot_time_from_rtc_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_recovered_status_pending) {
    if (write_status_row("gps_recovered", write_status) == MicroSD::WRITE_OK) gps_recovered_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && gps_i2c_recovered_status_pending) {
    if (write_status_row("gps_i2c_recovered", write_status) == MicroSD::WRITE_OK) gps_i2c_recovered_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && i2c_recovery_status_pending) {
    if (write_status_row("i2c_recovery", write_status) == MicroSD::WRITE_OK) i2c_recovery_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && sensor_data_lost_status_pending) {
    if (write_status_row("sensor_data_lost", write_status) == MicroSD::WRITE_OK) sensor_data_lost_status_pending = false;
  }
  if (write_status == MicroSD::WRITE_OK && supervisor_restart_status_pending) {
    if (write_status_row("supervisor_restart_pending", write_status) == MicroSD::WRITE_OK) supervisor_restart_status_pending = false;
  }
#endif

  Serial.println(data_row_buf);

  if (supervisor_restart_pending) {
    Serial.println(F("Supervisor restart after persistent GPS/I2C sensor loss"));
    write_rtc_restart_record(timestamp_calc_epoch, RTC_REASON_GPS_I2C_HARD_FAULT);
    delay(100);
#if defined(ARDUINO_ARCH_ESP8266) || defined(ARDUINO_ARCH_ESP32)
    ESP.restart();
#endif
  }
}

// Collect measurements
void processData(void){
  processDataBuffered();
}

#if 0
void processDataLegacyDisabled(void){
  // Prepare output string
  String data_str = "";

  // Measurement count
  int n_measurements = 0;
  String header = "";
  String cal_header = "";

  Cal::CalibrationResult cal_result;

#if USE_GPS
  // Add timestamps and location
  gps.update_values();
  data_str = data_str + gps.get_timestamp() + ",";
  data_str = data_str + gps.get_location() + ",";
  header += "timestamp_utc,lat,lon,alt,nb_sat,HDOP,";
#endif

#if USE_BATTERY
  header += "bat.mV,bat.perc,";
  data_str += String(bat.battery_mV()) + ",";    // Battery charge     [mV]
  data_str += String(bat.battery_pc()) + ",";    // Battery charge     [%]
  n_measurements += 2;
#endif

  // Go through i2c buses
#if I2C_MULTI
  size_t n = sizeof(i2c_buses)/sizeof(i2c_buses[0]);
  for (size_t i = 0; i < n; ++i) {
#endif
  
  #if USE_ADS1115
    header += "Sin.W_m2,Sout.W_m2,";
    data_str += String(ads_sensors[i]->read_val(1, 16, 25.83), 2) + ","; // ADC of Apogee SP-510, A1, Gain 16: ±0.256V, convert by 25.83 W m-2 / mV
    data_str += String(ads_sensors[i]->read_val(2, 16, 30.98), 2) + ","; // ADC of Apogee SP-610, A2, Gain 16: ±0.256V, convert by 30.98 W m-2 / mV
    n_measurements += 2;
  #endif
  #if USE_BME280
    // Read data
    float bme_temp = bme_sensors[i]->airT();
    float bme_rh   = bme_sensors[i]->airRH();
    float bme_p    = bme_sensors[i]->airP();
    float bme_h2o  = env.air_water_mole_frac(bme_temp, bme_rh, bme_p); // H2O mole fraction [mmol/mol]
    // Uncalibrated values
    header += "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,";
    data_str += String(bme_temp, 2) + ",";    // T                  [°C]
    data_str += String(bme_rh, 2) + ",";      // RH                 [%]
    data_str += String(bme_p, 2) + ",";       // Pressure           [Pa]
    data_str += String(bme_h2o, 2) + ",";     // H2O mole fraction  [mmol/mol]
    n_measurements += 4;
    #if USE_CAL
      header += "bme_T.C.cal,bme_T.flag,bme_P.Pa.cal,bme_P.flag,bme_H2O.mmol_mol.cal,bme_H2O.mmol_mol.flag,bme_RH.perc.cal,bme_RH.flag,";
      float rh_flag = 0;
      // Calibrated temperature
      cal_result = cal.calibrate_linear("temperature", i, bme_temp);
      float cal_temp = cal_result.calibratedValue;
      data_str += String(cal_temp, 2) + ",";                        // Temperature        [C]
      data_str += String(cal_result.flag) + ",";                    // Data quality flag after calibration
      rh_flag += cal_result.flag;
      // Calibrated pressure
      cal_result = cal.calibrate_linear("pressure", i, bme_p);
      float cal_p = cal_result.calibratedValue;
      data_str += String(cal_p, 2) + ",";      // Pressure
      data_str += String(cal_result.flag) + ",";                    // Data quality flag after calibration
      rh_flag += cal_result.flag;
      // Calibrated H2O mole fraction
      cal_result = cal.calibrate_linear("h2o", i, bme_h2o);
      float cal_h2o = cal_result.calibratedValue;
      data_str += String(cal_h2o, 2) + ",";     // H2O mole fraction [mmol/mol]
      data_str += String(cal_result.flag) + ",";                   // Data quality flag after calibration
      rh_flag += cal_result.flag;
      // Calibrated RH, calculate from calibrated T, P and H2O
      float cal_rh = env.air_relative_humidity(cal_temp, cal_p, cal_h2o);
      data_str += String(cal_rh, 2) + ",";      // RH
      data_str += String(rh_flag) + ",";// Data quality flag after calibration, combining the 3 existing flags
      n_measurements += 4;
      // FLAGS
      // -1 Indicates an error, invalid data
      // 2  Indicates a simple offset
      // 4  Indicates an error, bad data, return raw data
    #else
      header += "bme_T.C,bme_RH.perc,bme_P.Pa,bme_H2O.mmol_mol,";
      data_str += String(bme_sensors[i]->airT(), 2) + ",";          // Temperature        [C]
      data_str += String(bme_sensors[i]->airRH(), 2) + ",";         // RH                 [%]
      data_str += String(bme_sensors[i]->airP(), 2) + ",";          // Pressure           [Pa]
      float bme_h2o = env.air_water_mole_frac(bme_sensors[i]->airT(),
                                           bme_sensors[i]->airRH(),
                                           bme_sensors[i]->airP()); // H2O mole fraction [mmol/mol]
      data_str += String(bme_h2o, 2) + ",";     // H2O mole fraction [mmol/mol]

      n_measurements += 4;
    #endif
  #endif
  #if USE_SCD30
    #if USE_BME280
    // Always update air pressure in CO2 sensor before using it
    scd_sensors[i]->set_air_pressure(bme_sensors[i]->airP());
    #endif
    scd_sensors[i]->getData(); // Read the sensor and store the values
    // Read data
    float scd_T   = scd_sensors[i]->airT();
    float scd_RH  = scd_sensors[i]->airRH();
    float scd_CO2 = scd_sensors[i]->airCO2();
    header += "scd_T.C,scd_RH.perc,scd_CO2.ppm,";
    data_str += String(scd_T, 2) + ",";          // Temperature        [C]
    data_str += String(scd_RH, 2) + ",";         // RH                 [%]
    data_str += String(scd_CO2, 2) + ",";        // CO2                [ppm]
    n_measurements += 3;
    #if USE_CAL
      header += "scd_CO2.ppm.cal,scd_CO2.flag,";
      cal_result = cal.calibrate_linear("co2", i, scd_CO2);
      data_str += String(cal_result.calibratedValue, 2) + ",";      // CO2 concentration  [ppm]
      data_str += String(cal_result.flag) + ",";                    // Data quality flag after calibration
      n_measurements += 2;
    #else
      header += "scd_CO2.ppm,";
      data_str += String(scd_sensors[i]->airCO2(), 2) + ",";      // CO2 concentration  [ppm]
      n_measurements += 1;
    #endif
  #endif
  #if USE_SEN0465
    header += "sen_T.C,sen_O2.mmol_mol,";
    // Read data
    float sen_T = sen_sensors[i]->airT();        // Temperature        [C]
    float sen_O2 = sen_sensors[i]->airO2();      // Oxygen             [ppm]
    data_str += String(sen_T, 2) + ",";
    data_str += String(sen_O2, 2) + ",";
    n_measurements += 2;
    #if USE_CAL
      header += "sen_O2.mmol_mol.cal,sen_O2.flag,";
      cal_result = cal.calibrate_linear("o2", i, sen_O2);
      data_str += String(cal_result.calibratedValue, 2) + ",";     // Oxygen             [ppm]
      data_str += String(cal_result.flag) + ",";                   // Data quality flag after calibration
      n_measurements += 2;
    #else
      header += "sen_O2.mmol_mol,";
      data_str += String(sen_sensors[i]->airO2(), 2) + ",";          // Oxygen             [ppm]
      n_measurements += 1;
    #endif
  #endif
  #if USE_MLX90614
    header += "mlx_T.C,mlx_obj_T.C,";
    data_str += String(mlx_sensors[i]->airT(), 2) + ",";          // Air temperature    [C]
    data_str += String(mlx_sensors[i]->objT(), 2) + ",";          // Object temperature [C]
    n_measurements += 2;
  #endif

#if I2C_MULTI
  }
#endif

  // Remove "nan" strings to shorten CSV output
  data_str.replace("nan", "");

  // Save data
  //------------
  // Creates daily file name
  int year = 2020;
#if USE_GPS
  if (!isGPSDateValid()) {
    Serial.println(F("Invalid GPS date"));
    return;
  }
  String data_fn = "data_" + gps.get_date() + ".csv";
#else
  String data_fn = "data.csv";
#endif

#if USE_MICROSD
  // Write data to disk
  sd.write_data(data_fn.c_str(),
                header.c_str(),
                data_str.c_str(),
                MEASUREMENT_INTERVAL); // logging frequency last [s]
#endif
  
